Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/adc.h
/* -------- ADC_CHSR : (ADC Offset: 0x18) ( R/ 32) Channel Status Register -------- */
#define ADC_CHSR_CH0_Pos                      _UINT32_(0)                                          /* (ADC_CHSR) Channel 0 Status Position */
#define ADC_CHSR_CH0_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH0_Pos)                  /* (ADC_CHSR) Channel 0 Status Mask */
#define ADC_CHSR_CH0(value)                   (ADC_CHSR_CH0_Msk & (_UINT32_(value) << ADC_CHSR_CH0_Pos)) /* Assigment of value for CH0 in the ADC_CHSR register */
#define ADC_CHSR_CH1_Pos                      _UINT32_(1)                                          /* (ADC_CHSR) Channel 1 Status Position */
#define ADC_CHSR_CH1_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH1_Pos)                  /* (ADC_CHSR) Channel 1 Status Mask */
#define ADC_CHSR_CH1(value)                   (ADC_CHSR_CH1_Msk & (_UINT32_(value) << ADC_CHSR_CH1_Pos)) /* Assigment of value for CH1 in the ADC_CHSR register */
#define ADC_CHSR_CH2_Pos                      _UINT32_(2)                                          /* (ADC_CHSR) Channel 2 Status Position */
#define ADC_CHSR_CH2_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH2_Pos)                  /* (ADC_CHSR) Channel 2 Status Mask */
#define ADC_CHSR_CH2(value)                   (ADC_CHSR_CH2_Msk & (_UINT32_(value) << ADC_CHSR_CH2_Pos)) /* Assigment of value for CH2 in the ADC_CHSR register */
#define ADC_CHSR_CH3_Pos                      _UINT32_(3)                                          /* (ADC_CHSR) Channel 3 Status Position */
#define ADC_CHSR_CH3_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH3_Pos)                  /* (ADC_CHSR) Channel 3 Status Mask */
#define ADC_CHSR_CH3(value)                   (ADC_CHSR_CH3_Msk & (_UINT32_(value) << ADC_CHSR_CH3_Pos)) /* Assigment of value for CH3 in the ADC_CHSR register */
#define ADC_CHSR_CH4_Pos                      _UINT32_(4)                                          /* (ADC_CHSR) Channel 4 Status Position */
#define ADC_CHSR_CH4_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH4_Pos)                  /* (ADC_CHSR) Channel 4 Status Mask */
#define ADC_CHSR_CH4(value)                   (ADC_CHSR_CH4_Msk & (_UINT32_(value) << ADC_CHSR_CH4_Pos)) /* Assigment of value for CH4 in the ADC_CHSR register */
#define ADC_CHSR_CH5_Pos                      _UINT32_(5)                                          /* (ADC_CHSR) Channel 5 Status Position */
#define ADC_CHSR_CH5_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH5_Pos)                  /* (ADC_CHSR) Channel 5 Status Mask */
#define ADC_CHSR_CH5(value)                   (ADC_CHSR_CH5_Msk & (_UINT32_(value) << ADC_CHSR_CH5_Pos)) /* Assigment of value for CH5 in the ADC_CHSR register */
#define ADC_CHSR_CH6_Pos                      _UINT32_(6)                                          /* (ADC_CHSR) Channel 6 Status Position */
#define ADC_CHSR_CH6_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH6_Pos)                  /* (ADC_CHSR) Channel 6 Status Mask */
#define ADC_CHSR_CH6(value)                   (ADC_CHSR_CH6_Msk & (_UINT32_(value) << ADC_CHSR_CH6_Pos)) /* Assigment of value for CH6 in the ADC_CHSR register */
#define ADC_CHSR_CH7_Pos                      _UINT32_(7)                                          /* (ADC_CHSR) Channel 7 Status Position */
#define ADC_CHSR_CH7_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH7_Pos)                  /* (ADC_CHSR) Channel 7 Status Mask */
#define ADC_CHSR_CH7(value)                   (ADC_CHSR_CH7_Msk & (_UINT32_(value) << ADC_CHSR_CH7_Pos)) /* Assigment of value for CH7 in the ADC_CHSR register */
#define ADC_CHSR_Msk                          _UINT32_(0x000000FF)                                 /* (ADC_CHSR) Register Mask  */

#define ADC_CHSR_CH_Pos                       _UINT32_(0)                                          /* (ADC_CHSR Position) Channel 7 Status */
#define ADC_CHSR_CH_Msk                       (_UINT32_(0xFF) << ADC_CHSR_CH_Pos)                  /* (ADC_CHSR Mask) CH */
#define ADC_CHSR_CH(value)                    (ADC_CHSR_CH_Msk & (_UINT32_(value) << ADC_CHSR_CH_Pos)) 

/* -------- ADC_LCDR : (ADC Offset: 0x20) ( R/ 32) Last Converted Data Register -------- */
#define ADC_LCDR_LDATA_Pos                    _UINT32_(0)                                          /* (ADC_LCDR) Last Data Converted Position */
#define ADC_LCDR_LDATA_Msk                    (_UINT32_(0xFFFF) << ADC_LCDR_LDATA_Pos)             /* (ADC_LCDR) Last Data Converted Mask */
#define ADC_LCDR_LDATA(value)                 (ADC_LCDR_LDATA_Msk & (_UINT32_(value) << ADC_LCDR_LDATA_Pos)) /* Assigment of value for LDATA in the ADC_LCDR register */
#define ADC_LCDR_CHNBOSR_Pos                  _UINT32_(24)                                         /* (ADC_LCDR) Channel Number in Oversampling Mode Position */
#define ADC_LCDR_CHNBOSR_Msk                  (_UINT32_(0x1F) << ADC_LCDR_CHNBOSR_Pos)             /* (ADC_LCDR) Channel Number in Oversampling Mode Mask */
#define ADC_LCDR_CHNBOSR(value)               (ADC_LCDR_CHNBOSR_Msk & (_UINT32_(value) << ADC_LCDR_CHNBOSR_Pos)) /* Assigment of value for CHNBOSR in the ADC_LCDR register */
#define ADC_LCDR_Msk                          _UINT32_(0x1F00FFFF)                                 /* (ADC_LCDR) Register Mask  */

/* NO_OSR mode */
#define ADC_LCDR_NO_OSR_LDATA_Pos             _UINT32_(0)                                          /* (ADC_LCDR) Last Data Converted when No Oversampling Position */
#define ADC_LCDR_NO_OSR_LDATA_Msk             (_UINT32_(0xFFF) << ADC_LCDR_NO_OSR_LDATA_Pos)       /* (ADC_LCDR) Last Data Converted when No Oversampling Mask */
#define ADC_LCDR_NO_OSR_LDATA(value)          (ADC_LCDR_NO_OSR_LDATA_Msk & (_UINT32_(value) << ADC_LCDR_NO_OSR_LDATA_Pos))
#define ADC_LCDR_NO_OSR_CHNB_Pos              _UINT32_(12)                                         /* (ADC_LCDR) Channel Number when No Oversampling Position */
#define ADC_LCDR_NO_OSR_CHNB_Msk              (_UINT32_(0xF) << ADC_LCDR_NO_OSR_CHNB_Pos)          /* (ADC_LCDR) Channel Number when No Oversampling Mask */
#define ADC_LCDR_NO_OSR_CHNB(value)           (ADC_LCDR_NO_OSR_CHNB_Msk & (_UINT32_(value) << ADC_LCDR_NO_OSR_CHNB_Pos))
#define ADC_LCDR_NO_OSR_Msk                   _UINT32_(0x0000FFFF)                                  /* (ADC_LCDR_NO_OSR) Register Mask  */


/* -------- ADC_IER : (ADC Offset: 0x24) ( /W 32) Interrupt Enable Register -------- */
#define ADC_IER_RXRDY_Pos                     _UINT32_(0)                                          /* (ADC_IER) Receive Ready Interrupt Enable Position */
#define ADC_IER_RXRDY_Msk                     (_UINT32_(0x1) << ADC_IER_RXRDY_Pos)                 /* (ADC_IER) Receive Ready Interrupt Enable Mask */
#define ADC_IER_RXRDY(value)                  (ADC_IER_RXRDY_Msk & (_UINT32_(value) << ADC_IER_RXRDY_Pos)) /* Assigment of value for RXRDY in the ADC_IER register */
#define ADC_IER_RXEMPTY_Pos                   _UINT32_(1)                                          /* (ADC_IER) Receive FIFO Empty Interrupt Enable Position */
#define ADC_IER_RXEMPTY_Msk                   (_UINT32_(0x1) << ADC_IER_RXEMPTY_Pos)               /* (ADC_IER) Receive FIFO Empty Interrupt Enable Mask */
#define ADC_IER_RXEMPTY(value)                (ADC_IER_RXEMPTY_Msk & (_UINT32_(value) << ADC_IER_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the ADC_IER register */
#define ADC_IER_RXFULL_Pos                    _UINT32_(2)                                          /* (ADC_IER) Receive FIFO Full Interrupt Enable Position */
#define ADC_IER_RXFULL_Msk                    (_UINT32_(0x1) << ADC_IER_RXFULL_Pos)                /* (ADC_IER) Receive FIFO Full Interrupt Enable Mask */
#define ADC_IER_RXFULL(value)                 (ADC_IER_RXFULL_Msk & (_UINT32_(value) << ADC_IER_RXFULL_Pos)) /* Assigment of value for RXFULL in the ADC_IER register */
#define ADC_IER_RXCHUNK_Pos                   _UINT32_(3)                                          /* (ADC_IER) Receive FIFO Chunk Interrupt Enable Position */
#define ADC_IER_RXCHUNK_Msk                   (_UINT32_(0x1) << ADC_IER_RXCHUNK_Pos)               /* (ADC_IER) Receive FIFO Chunk Interrupt Enable Mask */
#define ADC_IER_RXCHUNK(value)                (ADC_IER_RXCHUNK_Msk & (_UINT32_(value) << ADC_IER_RXCHUNK_Pos)) /* Assigment of value for RXCHUNK in the ADC_IER register */
#define ADC_IER_RXUDR_Pos                     _UINT32_(4)                                          /* (ADC_IER) Receive Under Flow Interrupt Enable Position */
#define ADC_IER_RXUDR_Msk                     (_UINT32_(0x1) << ADC_IER_RXUDR_Pos)                 /* (ADC_IER) Receive Under Flow Interrupt Enable Mask */
#define ADC_IER_RXUDR(value)                  (ADC_IER_RXUDR_Msk & (_UINT32_(value) << ADC_IER_RXUDR_Pos)) /* Assigment of value for RXUDR in the ADC_IER register */
#define ADC_IER_RXOVR_Pos                     _UINT32_(5)                                          /* (ADC_IER) Receive Over Flow Interrupt Enable Position */
#define ADC_IER_RXOVR_Msk                     (_UINT32_(0x1) << ADC_IER_RXOVR_Pos)                 /* (ADC_IER) Receive Over Flow Interrupt Enable Mask */
#define ADC_IER_RXOVR(value)                  (ADC_IER_RXOVR_Msk & (_UINT32_(value) << ADC_IER_RXOVR_Pos)) /* Assigment of value for RXOVR in the ADC_IER register */
#define ADC_IER_SMEV_Pos                      _UINT32_(6)                                          /* (ADC_IER) Supply Monitor Event Interrupt Enable Position */
#define ADC_IER_SMEV_Msk                      (_UINT32_(0x1) << ADC_IER_SMEV_Pos)                  /* (ADC_IER) Supply Monitor Event Interrupt Enable Mask */
#define ADC_IER_SMEV(value)                   (ADC_IER_SMEV_Msk & (_UINT32_(value) << ADC_IER_SMEV_Pos)) /* Assigment of value for SMEV in the ADC_IER register */
#define ADC_IER_EOS_Pos                       _UINT32_(18)                                         /* (ADC_IER) End Of Sequence Interrupt Enable Position */
#define ADC_IER_EOS_Msk                       (_UINT32_(0x1) << ADC_IER_EOS_Pos)                   /* (ADC_IER) End Of Sequence Interrupt Enable Mask */
#define ADC_IER_EOS(value)                    (ADC_IER_EOS_Msk & (_UINT32_(value) << ADC_IER_EOS_Pos)) /* Assigment of value for EOS in the ADC_IER register */
#define ADC_IER_TEMPCHG_Pos                   _UINT32_(19)                                         /* (ADC_IER) Temperature Change Interrupt Enable Position */
#define ADC_IER_TEMPCHG_Msk                   (_UINT32_(0x1) << ADC_IER_TEMPCHG_Pos)               /* (ADC_IER) Temperature Change Interrupt Enable Mask */
#define ADC_IER_TEMPCHG(value)                (ADC_IER_TEMPCHG_Msk & (_UINT32_(value) << ADC_IER_TEMPCHG_Pos)) /* Assigment of value for TEMPCHG in the ADC_IER register */
#define ADC_IER_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_IER) Data Ready Interrupt Enable Position */
#define ADC_IER_DRDY_Msk                      (_UINT32_(0x1) << ADC_IER_DRDY_Pos)                  /* (ADC_IER) Data Ready Interrupt Enable Mask */
#define ADC_IER_DRDY(value)                   (ADC_IER_DRDY_Msk & (_UINT32_(value) << ADC_IER_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_IER register */
#define ADC_IER_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_IER) General Overrun Error Interrupt Enable Position */
#define ADC_IER_GOVRE_Msk                     (_UINT32_(0x1) << ADC_IER_GOVRE_Pos)                 /* (ADC_IER) General Overrun Error Interrupt Enable Mask */
#define ADC_IER_GOVRE(value)                  (ADC_IER_GOVRE_Msk & (_UINT32_(value) << ADC_IER_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_IER register */
#define ADC_IER_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_IER) Comparison Event Interrupt Enable Position */
#define ADC_IER_COMPE_Msk                     (_UINT32_(0x1) << ADC_IER_COMPE_Pos)                 /* (ADC_IER) Comparison Event Interrupt Enable Mask */
#define ADC_IER_COMPE(value)                  (ADC_IER_COMPE_Msk & (_UINT32_(value) << ADC_IER_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_IER register */
#define ADC_IER_ENDRX_Pos                     _UINT32_(27)                                         /* (ADC_IER) End of Receive Transfer Interrupt Enable Position */
#define ADC_IER_ENDRX_Msk                     (_UINT32_(0x1) << ADC_IER_ENDRX_Pos)                 /* (ADC_IER) End of Receive Transfer Interrupt Enable Mask */
#define ADC_IER_ENDRX(value)                  (ADC_IER_ENDRX_Msk & (_UINT32_(value) << ADC_IER_ENDRX_Pos)) /* Assigment of value for ENDRX in the ADC_IER register */
#define ADC_IER_RXBUFF_Pos                    _UINT32_(28)                                         /* (ADC_IER) Receive Buffer Full Interrupt Enable Position */
#define ADC_IER_RXBUFF_Msk                    (_UINT32_(0x1) << ADC_IER_RXBUFF_Pos)                /* (ADC_IER) Receive Buffer Full Interrupt Enable Mask */
#define ADC_IER_RXBUFF(value)                 (ADC_IER_RXBUFF_Msk & (_UINT32_(value) << ADC_IER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the ADC_IER register */
#define ADC_IER_Msk                           _UINT32_(0x1F0C007F)                                 /* (ADC_IER) Register Mask  */


/* -------- ADC_IDR : (ADC Offset: 0x28) ( /W 32) Interrupt Disable Register -------- */
#define ADC_IDR_RXRDY_Pos                     _UINT32_(0)                                          /* (ADC_IDR) Receive Ready Interrupt Disable Position */
#define ADC_IDR_RXRDY_Msk                     (_UINT32_(0x1) << ADC_IDR_RXRDY_Pos)                 /* (ADC_IDR) Receive Ready Interrupt Disable Mask */
#define ADC_IDR_RXRDY(value)                  (ADC_IDR_RXRDY_Msk & (_UINT32_(value) << ADC_IDR_RXRDY_Pos)) /* Assigment of value for RXRDY in the ADC_IDR register */
#define ADC_IDR_RXEMPTY_Pos                   _UINT32_(1)                                          /* (ADC_IDR) Receive FIFO Empty Interrupt Disable Position */
#define ADC_IDR_RXEMPTY_Msk                   (_UINT32_(0x1) << ADC_IDR_RXEMPTY_Pos)               /* (ADC_IDR) Receive FIFO Empty Interrupt Disable Mask */
#define ADC_IDR_RXEMPTY(value)                (ADC_IDR_RXEMPTY_Msk & (_UINT32_(value) << ADC_IDR_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the ADC_IDR register */
#define ADC_IDR_RXFULL_Pos                    _UINT32_(2)                                          /* (ADC_IDR) Receive FIFO Full Interrupt Disable Position */
#define ADC_IDR_RXFULL_Msk                    (_UINT32_(0x1) << ADC_IDR_RXFULL_Pos)                /* (ADC_IDR) Receive FIFO Full Interrupt Disable Mask */
#define ADC_IDR_RXFULL(value)                 (ADC_IDR_RXFULL_Msk & (_UINT32_(value) << ADC_IDR_RXFULL_Pos)) /* Assigment of value for RXFULL in the ADC_IDR register */
#define ADC_IDR_RXCHUNK_Pos                   _UINT32_(3)                                          /* (ADC_IDR) Receive FIFO Chunk Interrupt Disable Position */
#define ADC_IDR_RXCHUNK_Msk                   (_UINT32_(0x1) << ADC_IDR_RXCHUNK_Pos)               /* (ADC_IDR) Receive FIFO Chunk Interrupt Disable Mask */
#define ADC_IDR_RXCHUNK(value)                (ADC_IDR_RXCHUNK_Msk & (_UINT32_(value) << ADC_IDR_RXCHUNK_Pos)) /* Assigment of value for RXCHUNK in the ADC_IDR register */
#define ADC_IDR_RXUDR_Pos                     _UINT32_(4)                                          /* (ADC_IDR) Receive Under Flow Interrupt Disable Position */
#define ADC_IDR_RXUDR_Msk                     (_UINT32_(0x1) << ADC_IDR_RXUDR_Pos)                 /* (ADC_IDR) Receive Under Flow Interrupt Disable Mask */
#define ADC_IDR_RXUDR(value)                  (ADC_IDR_RXUDR_Msk & (_UINT32_(value) << ADC_IDR_RXUDR_Pos)) /* Assigment of value for RXUDR in the ADC_IDR register */
#define ADC_IDR_RXOVR_Pos                     _UINT32_(5)                                          /* (ADC_IDR) Receive Over Flow Interrupt Disable Position */
#define ADC_IDR_RXOVR_Msk                     (_UINT32_(0x1) << ADC_IDR_RXOVR_Pos)                 /* (ADC_IDR) Receive Over Flow Interrupt Disable Mask */
#define ADC_IDR_RXOVR(value)                  (ADC_IDR_RXOVR_Msk & (_UINT32_(value) << ADC_IDR_RXOVR_Pos)) /* Assigment of value for RXOVR in the ADC_IDR register */
#define ADC_IDR_SMEV_Pos                      _UINT32_(6)                                          /* (ADC_IDR) Supply Monitor Event Interrupt Disable Position */
#define ADC_IDR_SMEV_Msk                      (_UINT32_(0x1) << ADC_IDR_SMEV_Pos)                  /* (ADC_IDR) Supply Monitor Event Interrupt Disable Mask */
#define ADC_IDR_SMEV(value)                   (ADC_IDR_SMEV_Msk & (_UINT32_(value) << ADC_IDR_SMEV_Pos)) /* Assigment of value for SMEV in the ADC_IDR register */
#define ADC_IDR_EOS_Pos                       _UINT32_(18)                                         /* (ADC_IDR) End Of Sequence Interrupt Disable Position */
#define ADC_IDR_EOS_Msk                       (_UINT32_(0x1) << ADC_IDR_EOS_Pos)                   /* (ADC_IDR) End Of Sequence Interrupt Disable Mask */
#define ADC_IDR_EOS(value)                    (ADC_IDR_EOS_Msk & (_UINT32_(value) << ADC_IDR_EOS_Pos)) /* Assigment of value for EOS in the ADC_IDR register */
#define ADC_IDR_TEMPCHG_Pos                   _UINT32_(19)                                         /* (ADC_IDR) Temperature Change Interrupt Disable Position */
#define ADC_IDR_TEMPCHG_Msk                   (_UINT32_(0x1) << ADC_IDR_TEMPCHG_Pos)               /* (ADC_IDR) Temperature Change Interrupt Disable Mask */
#define ADC_IDR_TEMPCHG(value)                (ADC_IDR_TEMPCHG_Msk & (_UINT32_(value) << ADC_IDR_TEMPCHG_Pos)) /* Assigment of value for TEMPCHG in the ADC_IDR register */
#define ADC_IDR_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_IDR) Data Ready Interrupt Disable Position */
#define ADC_IDR_DRDY_Msk                      (_UINT32_(0x1) << ADC_IDR_DRDY_Pos)                  /* (ADC_IDR) Data Ready Interrupt Disable Mask */
#define ADC_IDR_DRDY(value)                   (ADC_IDR_DRDY_Msk & (_UINT32_(value) << ADC_IDR_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_IDR register */
#define ADC_IDR_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_IDR) General Overrun Error Interrupt Disable Position */
#define ADC_IDR_GOVRE_Msk                     (_UINT32_(0x1) << ADC_IDR_GOVRE_Pos)                 /* (ADC_IDR) General Overrun Error Interrupt Disable Mask */
#define ADC_IDR_GOVRE(value)                  (ADC_IDR_GOVRE_Msk & (_UINT32_(value) << ADC_IDR_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_IDR register */
#define ADC_IDR_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_IDR) Comparison Event Interrupt Disable Position */
#define ADC_IDR_COMPE_Msk                     (_UINT32_(0x1) << ADC_IDR_COMPE_Pos)                 /* (ADC_IDR) Comparison Event Interrupt Disable Mask */
#define ADC_IDR_COMPE(value)                  (ADC_IDR_COMPE_Msk & (_UINT32_(value) << ADC_IDR_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_IDR register */
#define ADC_IDR_ENDRX_Pos                     _UINT32_(27)                                         /* (ADC_IDR) End of Receive Transfer Interrupt Disable Position */
#define ADC_IDR_ENDRX_Msk                     (_UINT32_(0x1) << ADC_IDR_ENDRX_Pos)                 /* (ADC_IDR) End of Receive Transfer Interrupt Disable Mask */
#define ADC_IDR_ENDRX(value)                  (ADC_IDR_ENDRX_Msk & (_UINT32_(value) << ADC_IDR_ENDRX_Pos)) /* Assigment of value for ENDRX in the ADC_IDR register */
#define ADC_IDR_RXBUFF_Pos                    _UINT32_(28)                                         /* (ADC_IDR) Receive Buffer Full Interrupt Disable Position */
#define ADC_IDR_RXBUFF_Msk                    (_UINT32_(0x1) << ADC_IDR_RXBUFF_Pos)                /* (ADC_IDR) Receive Buffer Full Interrupt Disable Mask */
#define ADC_IDR_RXBUFF(value)                 (ADC_IDR_RXBUFF_Msk & (_UINT32_(value) << ADC_IDR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the ADC_IDR register */
#define ADC_IDR_Msk                           _UINT32_(0x1F0C007F)                                 /* (ADC_IDR) Register Mask  */


